src/Documents/бронь/бронь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>бронь</name>
  <attributes>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Фирма</types>
    </type>
  </attributes>
  <attributes>
    <name>сотрудники</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>клиент</name>
    <type>
      <types>CatalogRef.Клиент</types>
    </type>
  </attributes>
  <attributes>
    <name>услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/бронь/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура услугаПриИзменении(Элемент)
	Если Объект.услуга.Пустая() Тогда
		Объект.Длительность	= 0;
		Объект.сумма		= 0;
	Иначе
		
		ИнфомацияОбУслуге	= ДлительностьЦенаУслуги.ПолучитьИнформациюОбУслуги(Объект.услуга, Объект.Дата);
		Объект.Длительность	= ИнфомацияОбУслуге.Длительность;
		Объект.сумма		= ИнфомацияОбУслуге.Цена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка =ложь;
КонецПроцедуры
